IRP/src/Catalogs/PaymentTypes/PaymentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>PaymentTypes</name>
 <hierarchical>true</hierarchical>
 <hierarchyType>HierarchyOfItems</hierarchyType>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.PaymentTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Icon</name>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>isIconSet</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>FinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/BankTerms/BankTerms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>BankTerms</name>
 <attributes>
  <name>BankTermType</name>
  <type>
   <types>EnumRef.BankTermTypes</types>
  </type>
 </attributes>
 <tabularSections>
  <name>PaymentTypes</name>
  <attributes>
   <name>PaymentType</name>
   <type>
    <types>CatalogRef.PaymentTypes</types>
   </type>
  </attributes>
  <attributes>
   <name>Percent</name>
   <type>
    <types>DefinedType.typePercent</types>
   </type>
  </attributes>
  <attributes>
   <name>Account</name>
   <type>
    <types>CatalogRef.CashAccounts</types>
   </type>
  </attributes>
  <attributes>
   <name>Partner</name>
   <type>
    <types>CatalogRef.Partners</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalName</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>PartnerTerms</name>
   <type>
    <types>CatalogRef.Agreements</types>
   </type>
  </attributes>
  <attributes>
   <name>LegalNameContract</name>
   <type>
    <types>CatalogRef.LegalNameContracts</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/PaymentTypes/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	FilterIsSet = (TypeOf(Parameters) = Type("Structure") 
		And ValueIsFilled(Parameters.SearchString)
		And Parameters.Filter.Property("BankTerm"));
		
	If Not FilterIsSet Then
		Return;
	EndIf;
	
	StandardProcessing = False;
	CommonFormActionsServer.CutLastSymbolsIfCameFromExcel(Parameters);
	
	Query = New Query;
	If ValueIsFilled(Parameters.Filter.BankTerm) Then
		Query.Text = GetQueryText_Filter();
		Query.Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Query.Text, "Table.PaymentType");
	Else
		Query.Text = GetQueryText_All();
		Query.Text = LocalizationEvents.ReplaceDescriptionLocalizationPrefix(Query.Text);
	EndIf;
	
	Query.SetParameter("BankTerm", Parameters.Filter.BankTerm);
	Query.SetParameter("SearchString", Parameters.SearchString);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	ChoiceData = CommonFormActionsServer.QueryTableToChoiceData(QueryTable);
EndProcedure

Function GetQueryText_Filter()
	Return
		"SELECT
		|	2 AS Sort,
		|	Table.PaymentType.Description_en AS Presentation,
		|	Table.PaymentType AS Ref
		|FROM
		|	Catalog.BankTerms.PaymentTypes AS Table
		|WHERE
		|	Table.Ref = &BankTerm
		|	AND NOT Table.PaymentType.DeletionMark
		|	AND Table.PaymentType.Description_en LIKE ""%"" + &SearchString + ""%""
		|GROUP BY
		|	Table.PaymentType";
EndFunction
	
Function GetQueryText_All()
	Return 
		"SELECT
		|	2 AS Sort,
		|	Table.Description_en AS Presentation,
		|	Table.Ref
		|FROM
		|	Catalog.PaymentTypes AS Table
		|WHERE
		|	Table.Description_en LIKE ""%"" + &SearchString + ""%""
		|	AND NOT Table.DeletionMark";
EndFunction
